Find The Quiet Students In All Exams

''' Table: Student
+---------------------+---------+
| Column Name         | Type    |
+---------------------+---------+
| student_id          | int     |
| student_name        | varchar |
+---------------------+---------+

student_id is the primary key (column with unique values) for this table.

student_name is the name of the student.

Table: Exam
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| exam_id       | int     |
| student_id    | int     |
| score         | int     |
+---------------+---------+

(exam_id, student_id) is the primary key (combination of columns with unique values) for this table.

Each row of this table indicates that the student with student_id had a score points in the exam with id exam_id.

A quiet student is the one who took at least one exam and did not score the highest or the lowest score.

Write a solution to report the students (student_id, student_name) being quiet in all exams. Do not return the student who has never taken any exam.

Return the result table ordered by student_id.

Example:

Input:

Student table:
+-------------+---------------+
| student_id  | student_name  |
+-------------+---------------+
| 1           | Daniel        |
| 2           | Jade          |
| 3           | Stella        |
| 4           | Jonathan      |
| 5           | Will          |
+-------------+---------------+

Exam table:
+------------+--------------+-----------+
| exam_id    | student_id   | score     |
+------------+--------------+-----------+
| 10         |     1        |    70     |
| 10         |     2        |    80     |
| 10         |     3        |    90     |
| 20         |     1        |    80     |
| 30         |     1        |    70     |
| 30         |     3        |    80     |
| 30         |     4        |    90     |
| 40         |     1        |    60     |
| 40         |     2        |    70     |
| 40         |     4        |    80     |
+------------+--------------+-----------+

Output:
+-------------+---------------+
| student_id  | student_name  |
+-------------+---------------+
| 2           | Jade          |
+-------------+---------------+

Explanation:

For exam 1: Student 1 and 3 hold the lowest and high scores respectively.

For exam 2: Student 1 hold both highest and lowest score.

For exam 3 and 4: Student 1 and 4 hold the lowest and high scores respectively.

Student 2 and 5 have never got the highest or lowest in any of the exams.

Since student 5 is not taking any exam, he is excluded from the result.

So, we only return the information of Student 2.'''

In [ ]:
with cte as
(
select *,max(score) over(partition by exam_id) as max_score,
min(score) over(partition by exam_id) as min_score
from Exam
),
cte2 as 
(
select distinct student_id from cte where score =max_score or score=min_score
),
cte3 as (
select distinct student_id from cte 
where (score <> max_score or score <> min_score) and student_id not in(select student_id from cte2)
)

select * from student where student_id in (select student_id from cte3)
order by student_id;

Sql Report Contigous Dates

Table: Failed
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| fail_date    | date    |
+--------------+---------+

fail_date is the primary key (column with unique values) for this table.

This table contains the days of failed tasks.

Table: Succeeded
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| success_date | date    |
+--------------+---------+

success_date is the primary key (column with unique values) for this table.

This table contains the days of succeeded tasks.

A system is running one task every day. Every task is independent of the previous tasks. The tasks can fail or succeed.

Write a solution to report the period_state for each continuous interval of days in the period from 2019-01-01 to 2019-12-31.

period_state is 'failed' if tasks in this interval failed or 'succeeded' if tasks in this interval succeeded. Interval of days are retrieved as start_date and end_date.

Return the result table ordered by start_date.

Example:

Input:

Failed table:
+-------------------+
| fail_date         |
+-------------------+
| 2018-12-28        |
| 2018-12-29        |
| 2019-01-04        |
| 2019-01-05        |
+-------------------+

Succeeded table:
+-------------------+
| success_date      |
+-------------------+
| 2018-12-30        |
| 2018-12-31        |
| 2019-01-01        |
| 2019-01-02        |
| 2019-01-03        |
| 2019-01-06        |
+-------------------+

Output:
+--------------+--------------+--------------+
| period_state | start_date   | end_date     |
+--------------+--------------+--------------+
| succeeded    | 2019-01-01   | 2019-01-03   |
| failed       | 2019-01-04   | 2019-01-05   |
| succeeded    | 2019-01-06   | 2019-01-06   |
+--------------+--------------+--------------+

Explanation:

The report ignored the system state in 2018 as we care about the system in the period 2019-01-01 to 2019-12-31.

From 2019-01-01 to 2019-01-03 all tasks succeeded and the system state was "succeeded".

From 2019-01-04 to 2019-01-05 all tasks failed and the system state was "failed".

From 2019-01-06 to 2019-01-06 all tasks succeeded and the system state was "succeeded".

In [ ]:
with cte as (
select 'failed' as period_state,fail_date as event_date 
from Failed where strftime('%Y',fail_date)='2019'
union all
select  'succeeded' as period_state,success_date as event_date 
from Succeeded where strftime('%Y',success_date)='2019'), cte1 as (
select *,lag(period_state,1,period_state) over(order by event_date) as prev_state 
from cte),cte2 as (
    select *, 
    sum(case when period_state=prev_state then 0 else 1 end) over(order by event_date) as group_ 
    from cte1
)
select period_state,min(event_date)as start_date,max(event_date) as end_date from cte2
group by period_state,group_
order by start_date;

All People Report To The Given Manager

Table: Employees
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| employee_id   | int     |
| employee_name | varchar |
| manager_id    | int     |
+---------------+---------+

employee_id is the column of unique values for this table.

Each row of this table indicates that the employee with ID employee_id and name employee_name reports his work to his/her direct manager with manager_id

The head of the company is the employee with employee_id = 1.

Write a solution to find employee_id of all employees that directly or indirectly report their work to the head of the company.

The indirect relation between managers will not exceed three managers as the company is small.

Return the result table in ascending order of employee_id.

Example:

Input:

Employees table:
+-------------+---------------+------------+
| employee_id | employee_name | manager_id |
+-------------+---------------+------------+
| 1           | Boss          | 1          |
| 3           | Alice         | 3          |
| 2           | Bob           | 1          |
| 4           | Daniel        | 2          |
| 7           | Luis          | 4          |
| 8           | Jhon          | 3          |
| 9           | Angela        | 8          |
| 77          | Robert        | 1          |
+-------------+---------------+------------+

Output:
+-------------+
| employee_id |
+-------------+
| 2           |
| 4           |
| 7           |
| 77          |
+-------------+

Explanation:

The head of the company is the employee with employee_id 1.

The employees with employee_id 2 and 77 report their work directly to the head of the company.

The employee with employee_id 4 reports their work indirectly to the head of the company 4 --> 2 --> 1.

The employee with employee_id 7 reports their work indirectly to the head of the company 7 --> 4 --> 2 --> 1.

The employees with employee_id 3, 8, and 9 do not report their work to the head of the company directly or indirectly.

In [ ]:
with recursive cte as (
select employee_id from Employees
where manager_id=1 and employee_id<>1
union
select e.employee_id from Employees as e
inner join cte as c
on e.manager_id=c.employee_id
)
select * from cte
order by employee_id;

Find The Subtasks That Did Not Execute

Table: Tasks
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| task_id        | int     |
| subtasks_count | int     |
+----------------+---------+

task_id is the column with unique values for this table.

Each row in this table indicates that task_id was divided into subtasks_count subtasks labeled from 1 to subtasks_count.

It is guaranteed that 2 <= subtasks_count <= 20.

Table: Executed
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| task_id       | int     |
| subtask_id    | int     |
+---------------+---------+

(task_id, subtask_id) is the combination of columns with unique values for this table.

Each row in this table indicates that for the task task_id, the subtask with ID subtask_id was executed successfully.

It is guaranteed that subtask_id <= subtasks_count for each task_id.

Write a solution to report the IDs of the missing subtasks for each task_id.

Return the result ordered by task_id and then by subtask_id

Example:

Input:

Tasks table:
+---------+----------------+
| task_id | subtasks_count |
+---------+----------------+
| 1       | 3              |
| 2       | 2              |
| 3       | 4              |
+---------+----------------+

Executed table:
+---------+------------+
| task_id | subtask_id |
+---------+------------+
| 1       | 2          |
| 3       | 1          |
| 3       | 2          |
| 3       | 3          |
| 3       | 4          |
+---------+------------+

Output:
+---------+------------+
| task_id | subtask_id |
+---------+------------+
| 1       | 1          |
| 1       | 3          |
| 2       | 1          |
| 2       | 2          |
+---------+------------+

Explanation:

Task 1 was divided into 3 subtasks (1, 2, 3). Only subtask 2 was executed successfully, so we include (1, 1) and (1, 3) in the answer.

Task 2 was divided into 2 subtasks (1, 2). No subtask was executed successfully, so we include (2, 1) and (2, 2) in the answer.

Task 3 was divided into 4 subtasks (1, 2, 3, 4). All of the subtasks were executed successfully.

In [ ]:
with recursive cte as(
select task_id,subtasks_count,1 as subtask_id
from Tasks
union all
select task_id,subtasks_count,subtask_id+1 as subtask_id
from cte where subtask_id<subtasks_count)

select task_id,subtask_id
from cte
where (task_id,subtask_id) not in (select task_id,subtask_id from Executed)
order by task_id;